import React from "react";

function About() {
  return (
    <section id="about" className="fade-section glass">
      <h2>Обо мне</h2>
      <p>
Я развиваюсь в направлении backend-разработки на C++ (3 года) и C# (2 года), уделяя особое внимание производительности, архитектуре приложений и работе со сложными структурами данных. Мне интересны оптимизация алгоритмов и создание решений.
В своих проектах я стремлюсь сочетать чистый код с продуманной логикой и практической пользой. Люблю разбираться в новых технологиях, экспериментировать с инструментами и искать наиболее эффективные подходы к разработке. 
Это портфолио создано, чтобы показать мой текущий уровень, стиль работы и дальнейший рост как разработчика.
      </p>
    </section>
  );
}

export default About;