import React from "react";

function About() {
  return (
    <section id="about" className="fade-section glass">
      <h2>Обо мне</h2>
      <p>
        Я — начинающий программист, который делает первые шаги в профессиональной
        разработке и активно развивает навыки в современных технологиях. Меня
        интересует создание удобных и быстрых веб-приложений, работа со
        структурой данных и архитектурой программ. В проектах я стараюсь
        сочетать чистый код, продуманный интерфейс и практическую ценность.
        Люблю разбираться в новых инструментах, искать оптимальные решения и
        прокачивать себя как разработчика — как в учебных, так и в личных
        проектах. Это портфолио создано, чтобы показать мои текущие навыки и
        дальнейший рост.
      </p>
    </section>
  );
}

export default About;